package com.example.user.poemapplication;

import android.content.Context;
import android.content.Intent;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.TextView;

import java.util.ArrayList;
import java.util.List;
import java.util.Locale;

public class ListViewAdapter extends BaseAdapter{

    //variables
    Context mContext;
    LayoutInflater inflater;
    List<Model> modellist;
    ArrayList<Model> arrayList;

    //constructor
    public ListViewAdapter(Context context, List<Model> modellist) {
        mContext = context;
        this.modellist = modellist;
        inflater = LayoutInflater.from(mContext);
        this.arrayList = new ArrayList<Model>();
        this.arrayList.addAll(modellist);
    }

    public class ViewHolder{
        TextView mTitleTv, mDescTv;
        ImageView mIconIv;
    }

    @Override
    public int getCount() {
        return modellist.size();
    }

    @Override
    public Object getItem(int i) {
        return modellist.get(i);
    }

    @Override
    public long getItemId(int i) {
        return i;
    }

    @Override
    public View getView(final int postition, View view, ViewGroup parent) {
        ViewHolder holder;
        if (view==null){
            holder = new ViewHolder();
            view = inflater.inflate(R.layout.row, null);

            //locate the views in row.xml
            holder.mTitleTv = view.findViewById(R.id.mainTitle);
            holder.mDescTv = view.findViewById(R.id.mainDesc);
            holder.mIconIv = view.findViewById(R.id.mainIcon);

            view.setTag(holder);

        }
        else {
            holder = (ViewHolder)view.getTag();
        }
        //set the results into textviews
        holder.mTitleTv.setText(modellist.get(postition).getTitle());
        holder.mDescTv.setText(modellist.get(postition).getDesc());
        //set the result in imageview
        holder.mIconIv.setImageResource(modellist.get(postition).getIcon());

        //listview item clicks
        view.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                //code later
                //1.
                if (modellist.get(postition).getTitle().equals("เรือพระที่นั่งนารายณ์ทรงสุบรรณ")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือพระที่นั่งนารายณ์ทรงสุบรรณ");
                    intent.putExtra("contentTv", "เรือพระที่นั่งนารายณ์ทรงสุบรรณ");
                    intent.putExtra("detailBoat","\t\tเรือพระที่นั่งนารายณ์ทรงสุบรรณ รัชกาลที่ 9 เป็นเรือพระที่นั่งกิ่งประเภทเรือรูปสัตว์ หนึ่งในเรือพระราชพิธี " +
                            "ในกระบวนพยุหยาตราชลมารค จัดสร้างขึ้นเพื่อเฉลิมฉลองในวโรกาส พระราชพิธีกาญจนาภิเษก แห่งพระบาทสมเด็จ"+
                            "พระปรมินทรมหาภูมิพลอดุลยเดช ในวันที่ 9 มิถุนายน พ.ศ. 2539 โดย กองทัพเรือ ร่วมกับ กรมศิลปากรได้นำ โขนเรือพระที่นั่งนารายณ์ทรงสุบรรณ ที่สร้างขึ้น ในสมัยรัชกาลที่ 3 และ รัชกาลที่ 4 มาเป็นต้นแบบ" +
                            "โดยกองทัพเรือ สร้างในส่วนที่เป็นโครงสร้างเรือ" +
                            "พาย และคัดฉาก ส่วนกรมศิลปากร ดำเนินการในงานที่เกี่ยวกับ ศิลปกรรมของเรือทั้งหมด แล้วขนานนามว่า “เรือนารายณ์ทรงสุบรรณ”" +
                            "ต่อมาเรือได้เสื่อมสภาพลงคงเหลือแต่โขนเรือเก็บรักษาไว้ในพิพิธภัณฑ์สถานแห่งชาติขั้นตอนการจัดสร้างเรือพระที่นั่งนารายณ์ทรงสุบรรณ รัชกาลที่ 9" +
                            "แบบเรือได้คงขนาดและลักษณะของลวดลายแกะสลักทั้งหลายไว้ตามแบบเรือพระที่นั่งนารายณ์ทรงสุบรรณลำเก่า แต่ได้ปรับปรุงให้โขนเรือมีความสูงเพิ่มขึ้น" +
                            "และส่วนที่เป็นรูปพระครุฑพ่าห์ก็ออกแบบให้มีความงดงามยิ่งขึ้น พร้อมทั้งได้ขยายพื้นที่ของลำเรือให้กว้างขวางขึ้น โดยเฉพาะส่วนที่ทอดบัลลังก์กัญญาและประดับเครื่องสูงทั้งหลาย" +
                            "เริ่มดำเนินการสร้างตั้งแต่ วันที่ 1 มิถุนายน พ.ศ. 2537 กรมอู่ทหารเรือรับเป็นผู้จัดสร้างตัวเรือ พาย และคัดฉาก ส่วนกรมศิลปากรเป็นผู้ดูแลการออกแบบ" +
                            "แกะสลักลวดลายตลอดจนการลงรักปิดทองประดับกระจก\n"+"\n"+"ลักษณะ\n"+
                            "\t\tขนาดของเรือ มีความยาว 44.3 เมตร ความยาวแนวน้ำหนักบรรทุกเต็มที่ 34.6 เมตร ความกว้าง 3.2 เมตร ความลึก 1.1 เมตร" +
                            " กินน้ำลึก 0.4 เมตร ระวางน้ำบรรทุกขับเต็มที่ 20 ตัน มีฝีพาย 50 นาย สิ้นค่าใช้จ่ายประมาณ 11.9 ล้านบาท"
                    );
                    mContext.startActivity(intent);
                }
                //2.
                if (modellist.get(postition).getTitle().equals("เรือพระที่นั่งอเนกชาติภุชงค์")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือพระที่นั่งอเนกชาติภุชงค์");
                    intent.putExtra("contentTv", "เรือพระที่นั่งอเนกชาติภุชงค์");
                    intent.putExtra("detailBoat", "\t\tเรือพระที่นั่งอเนกชาติภุชงค์ เป็นเรือพระที่นั่งรอง ในกระบวนพยุหยาตราชลมารค ลักษณะเด่นคือมีโขนเรือเชิดเรียว ไม่ได้สร้างเป็นรูปสัตว์ในตำนาน\n" +
                            "แต่จำหลักและปิดทองเป็นรูปพญานาคจำนวนมาก จึงได้ชื่อว่า อเนกชาติภุชงค์ (อเนก หมายถึง จำนวนมาก, ชาติภุชงค์ หมายถึง พญานาค)\n" +
                            "เรือพระที่นั่งอเนกชาติภุชงค์สร้างขึ้นใหม่ในรัชสมัยพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว รัชกาลที่ 5 ก่อนหน้านี้ไม่ปรากฏชื่อเรือพระที่นั่งลำนี้\n" +
                            "จัดเป็นเรือพระที่นั่งศรี ในลำดับชั้นรองใช้ในการเสด็จพระราชดำเนินลำลอง ภายหลังนำเข้ากระบวนพยุหยาตราชลมารค เรียกว่า เรือพระที่นั่งรอง\n" +
                            "นับเป็นเรือพระที่นั่งลำเดียวที่สร้างขึ้นในรัชกาลที่ 5 ปัจจุบันเก็บรักษาที่ พิพิธภัณฑสถานแห่งชาติ เรือพระราชพิธี ริมคลองบางกอกน้อย ใกล้สะพานอรุณอมรินทร์\n" +
                            "\n"+"ลักษณะ\n"+
                            "\t\tโขนเรือจำหลักปิดทองเป็นรูปพญานาคเล็ก ๆ จำนวนมาก ลำเรือภายนอกทาสีชมพู ท้องเรือภายในทาสีแดง ยาว 45.50 เมตร กว้าง 3.15 เมตร ลึก 1.11 เมตร\n" +
                            "กินน้ำลึก .46 เมตร กำลัง 3.50 เมตร ใช้ฝีพาย 61 คน นายท้าย 2 คน นายเรือ 2 คน ถือธงท้าย 1 คน พลสัญญาณ 1 คน คนเห่ 1 คน");
                    mContext.startActivity(intent);
                }
                //3.
                if (modellist.get(postition).getTitle().equals("เรืออสุรวายุภักษ์")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรืออสุรวายุภักษ์");
                    intent.putExtra("contentTv", "เรืออสุรวายุภักษ์");
                    intent.putExtra("detailBoat", "\t\tเรืออสุรวายุภักษ์ เป็นเรือรูปสัตว์ในประเภทเรือเหล่าแสนยากร เป็นหนึ่งในเรือพระราชพิธีกระบวนพยุหยาตราชลมารค เรืออสุรวายุภักษ์ โขนเรือเป็นรูปครึ่งยักษ์ครึ่งนก มีส่วนบนเป็นยักษ์\n" +
                            "ส่วนล่างเป็นนกองค์เป็นสีม่วง ลักษณะและขนาดของเรือใกล้เคียงกับเรืออสุรปักษี การแต่งกายของผู้ประจำเรือ นายลำนุ่งปูม สวมเสื้อเข้มขาบ โพกขลิบทองปัจจุบันเก็บรักษาที่โรงเรือท่าวาสุกรี\n"+
                            "\n"+ "ลักษณะ\n"+
                            "\t\tขนาดกว้าง 2.03 เมตร ยาว 31 เมตร ลึก 0.62 เมตร ฝีพาย 40 นาย เจ้าหน้าที่ประจำเรือ 17 นาย");
                    mContext.startActivity(intent);
                }
                //4.
                if (modellist.get(postition).getTitle().equals("เรือกระบี่ปราบเมืองมาร")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือกระบี่ปราบเมืองมาร");
                    intent.putExtra("contentTv", "เรือกระบี่ปราบเมืองมาร");
                    intent.putExtra("detailBoat", "\t\tเรือกระบี่ปราบเมืองมาร เป็นเรือพระราชพิธี ชนิดหนึ่งหน้ามีลักษณะเหมือนรูปโขน ลำเดิมเป็นเรือพื้นดำ ยาว 13 วา 2 ศอก 1 คืบ กว้าง 4 ศอก ลึก 1 ศอก กำลัง 5\n" +
                            "ศอก 4 นิ้ว ลำเดิมถูกระเบิดเสียหาย กรมศิลปากรเก็บหัวเรือท้ายเรือไว้ ในพิพิธภัณฑ์เมื่อปี พ.ศ. 2519ส่วนลำปัจจุบันสร้างใหม่ เมื่อ \n" +
                            "พ.ศ. 2510 โดยใช้หัวเรือเดิมนำมาซ่อมแซมช่างแกะสลักลวดลายทำงานประมาณ 12 เดือน ช่างรักทำงานประมาณ 4 เดือน ช่างเขียนทำงานประมาณ 6 เดือน\n" +
                            "ช่างปิดทองและประดับกระจกทำงานประมาณ 4 เดือน น้ำหนัก 5.62 ตัน\n" +
                            "พ.ศ. 2512 จัดทำเครื่องตกแต่งเรือใหม่ตั้งแต่ 29 กันยายน พ.ศ. 2512 จนถึง 25 กุมภาพันธ์\n" +
                            "พ.ศ. 2513 โดยบริษัท สำนักงานเกษรดอก ประดู่ จำกัด เป็นผู้ทำ\n" +
                            "พ.ศ. 2525 ซ่อมใหญ่เปลี่ยนไม้ตัวเรือที่ผุหรือชำรุดบางส่วน ลงรักปิดทอง ทาสีตัวเรือใหม่และอื่น ๆ เพื่อให้ทันใช้ในงานสมโภชกรุงรัตนโกสินทร์ 200 ปีในวันที่ 5 เมษายน พ.ศ. 2525 เริ่มซ่อมทำตั้งแต่ 4 กันยายน\n" +
                            "พ.ศ. 2524 จนถึงวันที่ 2 มีนาคม พ.ศ. 2525 โดยมี บริษัท สหายสันต์ จำกัด เป็นผู้รับเหมาซ่อมทำ การแต่งกายของผู้ประจำเรือ นายลำนุ่งปูม สวมเสื้อเข้มขาบ โพกขลิบทอง\n"+
                            "\n"+ "ลักษณะ\n"+
                            "\t\tยาว 26.80 เมตร กว้าง 2.10 เมตร ลึก 0.51 เมตร กินน้ำลึก 0.25 เมตร ฝีพาย 36 นาย นายท้าย 2 นาย หัวเรือมีช่องสำ หรับติดตั้งปืนใหญ่ 1 กระบอก ขนาด 65 มม. เหนือช่องปืนและเป็นรูปขุนกระบี่สีขาว");
                    mContext.startActivity(intent);
                }
                //5.
                if (modellist.get(postition).getTitle().equals("เรือเสือคำรณสินธุ์")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือเสือคำรณสินธุ์");
                    intent.putExtra("contentTv", "เรือเสือคำรณสินธุ์");
                    intent.putExtra("detailBoat", "\t\tเรือเสือคำรณสินธุ์ เป็นเรือที่ดัดแปลงมาจากเรือรบ (เรือที่ใช้ในสงคราม) เป็นเรือนำกระบวนเรือพยุหยาตราชลมารคในสมัยโบราณเรียกเรือลักษณะนี้ว่า\n" +
                            "เรือพิฆาตเรือวาดและลงสีรูปเสือไว้ที่หัวเรือซึ่งมีช่องไว้สำหรับใส่ปืนใหญ่ ถือเป็นเรือพิทักษ์กระบวนเรือพยุหยาตราชลมารคด้วย\n" +
                            " จึงต้องให้อำมาตย์ผู้ใหญ่ฝ่ายทหารเป็นผู้นั่งประจำในคฤห์ (เก๋ง) ของเรือในรัชสมัยสมเด็จพระนารายณ์มหาราช (พุทธศักราช 2199-2231)\n" +
                            "ชื่อเรือเสือคำรณสินธุ์ ปรากฏชื่อในลิลิตกระบวนแห่พระกฐินพยุหยาตราทั้งสถลมารคและทางชลมารคในพุทธศักราช 2387\n" +
                            "แต่ไม่ทราบว่าสร้างขึ้นครั้งแรกเมื่อใด เรือนี้ซ่อมแซมขึ้นใหม่ในปีพุทธศักราช 2534\n"+ "\n" + "ลักษณะ\n" +
                            "\t\tหัวเรือเขียนสีเป็นรูปสัตว์ ลำเรือภายนอกทาสีเหมือนลายเสือไม่ลงรักปิดทอง ภายในท้องเรือทาสีแดง ยาว 22.27 เมตร กว้าง 1.78 เมตร ลึก 0.57 เมตร" +
                            "กำลัง 2.48 เมตร ฝีพาย 26 คน นายท้าย 1 คน นายเรือ 2 คน นั่งคฤห์กัญญา 3 คน พลสัญญาณ 1 คน มีปืนบรรจุปากกระบอก 1 กระบอก");
                    mContext.startActivity(intent);
                }
                //6.
                if (modellist.get(postition).getTitle().equals("เรือสมรรถไชย")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือสมรรถไชย");
                    intent.putExtra("contentTv", "เรือสมรรถไชย");
                    intent.putExtra("detailBoat", "\t\tเรือสมรรถไชย เรือพระที่นั่งนี้มีมานานแล้วแต่ครั้งกรุงศรีอยุธยาปรากฏในตำราริ้วกระบวนแห่พยุหยาตราชลมารคสมเด็จพระนารายณ์มหาราช\n" +
                            "เป็นเรือกิ่งพื้นดำและมีปรากฏชื่อในโคลงพระราชพิธีทวาทศมาสในรัชกาลที่ ๔แห่งกรุงรัตนโกสินทร์ด้วย เป็นเรือพระที่นั่งสำหรับทรงเปลื้องเครื่อง\n" +
                            "เพราะมีการตั้งบัลลังก์บุษบก อัญเชิญพระชฎามหากฐินนำหน้าเรือพระที่นั่งลำทรง ตั้งเครื่องสูงด้านหน้าฉัตร ๗ ชั้น ๑ องค์  ฉัตร ๕ ชั้น ๒ องค์\n" +
                            "ด้านหลังบุษบกตั้งฉัตร ๗ ชั้น ๑ องค์  ฉัตร ๕ ชั้น ๒ องค์ ม่านบุษบกเป็นผ้าตาด  มีตำรวจประจำเรือ ๖ นาย  นักสราชนั่งเชิญธง ด้านหน้าและด้านหลัง ด้านละ ๑ องค์");
                    mContext.startActivity(intent);
                }
                //7.
                if (modellist.get(postition).getTitle().equals("เรือพระที่นั่งสุพรรณหงส์")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือพระที่นั่งสุพรรณหงส์");
                    intent.putExtra("contentTv", "เรือพระที่นั่งสุพรรณหงส์");
                    intent.putExtra("detailBoat", "\t\tเรือพระที่นั่งสุวรรณหงส์มีชื่อกล่าวถึงเป็นครั้งแรกในสมัยกรุงศรีอยุธยาต้นรัชกาลสมเด็จพระมหาจักรพรรดิราวปี พ.ศ. 2091 ในสมัยกรุงศรีอยุธยาเรียกว่า\n" +
                            "\"สุวรรณหงส์\" ดังทราบได้จากบทเห่เรือของเจ้าฟ้าธรรมธิเบศร์ฯที่ว่า ในหนังสือตำนานเรือรบไทยพระนิพนธ์สมเด็จกรมพระยาดำรงราชานุภาพได้ทรงกล่าวไว้ว่า\n" +
                            "เรือศรีสุพรรณหงส์สร้างในสมัยกรุงรัตนโกสินทร์ในสมัยพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช ตามจดหมายเหตุเมื่อปี พ.ศ. 2370\n" +
                            "มีหมายรับสั่งให้จัด \"เรือพระที่นั่งศรีสุพรรณหงส์\" เป็นเรือทรงพระบรมธาตุที่ได้มาจากเวียงจันทน์ ในจดหมายเหตุในรัชกาลที่ 3 และรัชกาลที่ 4\n" +
                            "เรียกชื่อเรือนี้ว่า \"เรือศรีสุพรรณหงส์\" เรือศรีสุพรรณหงส์ได้ชำรุดทรุดโทรมเรื่อยมา และได้รับการซ่อมแซมมาหลายครั้ง\n" +
                            "เรือพระที่นั่งสุพรรณหงส์ลำปัจจุบัน เป็นเรือพระที่นั่งที่พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวโปรดเกล้าฯให้ต่อขึ้นใหม่เพราะเรือพระที่นั่งศรีสุพรรณหงส์\n" +
                            "ลำเดิมผุพังเกินที่จะซ่อมได้ แต่มาเสร็จสมบูรณ์ในสมัยพระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว และเปลี่ยนชื่อเป็นเรือพระที่นั่งสุพรรณหงส์\n" +
                            "มีพลตรีพระยาราชสงคราม (กร หงสกุล) เป็นนายช่าง ประกอบพิธีลงน้ำ เมื่อวันที่ 13 พฤศจิกายน พ.ศ. 2454\n" +
                            "\n"+
                            "ลักาณะ\n"+
                            "\t\tนาวาสถาปนิกของเรือสุพรรณหงส์คือ พลเรือตรีพระยาราชสงคราม (กร หงสกุล) จัดเป็นเรือพระที่นั่งกิ่ง มักใช้เป็นเรือพระที่นั่งทรงของพระเจ้าอยู่หัว\n" +
                            "โขนเรือเป็นรูปหงส์ ลงรักปิดทองประดับกระจก ภายนอกทาสีดำ ท้องเรือภายในทาสีแดง ยาว 44.9 เมตร กว้าง 3.14 เมตร\n" +
                            "ลึก 0.9 เมตร กินน้ำลึก 0.41 เมตร กำลัง 3.5 เมตร (พายครั้งหนึ่งแล่นไปได้ไกล 3.5 เมตร) หนัก 15.1 ตัน พายทอง");
                    mContext.startActivity(intent);
                }
                //8.
                if (modellist.get(postition).getTitle().equals("เรือไกรสรมุข")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือไกรสรมุข");
                    intent.putExtra("contentTv", "เรือไกรสรมุข");
                    intent.putExtra("detailBoat", "\t\tจะเห็นว่าเรือสมรรถไชยและเรือไกรสรมุขเป็นเรือเสี่ยงทายตามกล่าว แต่ความจริงหาได้เป็นเช่นนั้นไม่ เรือสมรรถไชยเป็นเรือต้น\n" +
                            "ซึ่งเป็นเรือของพระเจ้าแผ่นดิน เรือไกรสรมุขเป็นเรือของพระอัครมเหสี ฉะนั้นการเสี่ยงทายเรือไกรสรมุขต้องชนะเสมอไป\n" +
                            "เพราะเป็นการปลอบขวัญประชาชน แสดงถึงความเอาอกเอาใจต่อพระมเหสีด้วย เห็นได้ว่า ประเพณีการแข่งเรือ\n" +
                            "ตามประเพณีหลวงสมัยโบราณที่ได้กระทำกันมาตั้งแต่สมัยกรุงศรีอยุธยา พอมาถึงกรุงรัตนโกสินทร์ประเพณีนี้ไม่มีการปฏิบัติกัน\n" +
                            "แต่ก็ไม่ถึงกับหายสาบสูญไป มีการแข่งขันกันบ้าง สำหรับการแข่งเรือสมัยรัตนโกสินทร์ที่ต้องมีการจารึกไว้ในประวัติศาสตร์\n" +
                            "คือ การแข่งเรือวังหลวง กับวังหน้า แต่การแข่งขันครั้งนั้นไม่บริสุทธิ์ ถือว่ามีเล่ห์เหลี่ยม เกือบทำให้เกิดเรื่องยุ่งยาก\n" +
                            "เรื่องมีอยู่ว่า ในแผ่นดินสมเด็จพระพุทธยอดฟ้าจุฬาโลก ได้มีการแข่งเรือระหว่างวังหลวงกับวังหน้าขึ้น ครั้งหนึ่งเรือวังหลวงชื่อทองปลิว\n" +
                            "เรือวังหน้าชื่อ มังกร เมื่อจับคู่เทียบฝีพายกันแล้วเห็นว่าทัดเทียมกันจะแข่งขันกันได้ก็ตกลง แต่ก่อนที่จะมีการลงมือแข่งขันได้ม\n" +
                            "ข้าราชการหลวงผู้หนึ่งสืบทราบว่า ทางวังหน้าเล่นไม่ซื่อ จึงได้นำความขึ้นกราบบังคมทูลว่ากรมพระราชวังบวรฯ\n" +
                            "จัดฝีพายที่แข็งแรงซ่อนไว้ เวลาแข่งจะเอาพวกนี้ออกพายแข่ง เมื่อได้ทรงทราบจึงมีพระดำรัสว่า  เล่นอย่างนี้จะเล่นด้วยอย่างไร จึงให้เลิกการแข่งเรือคราวนั้นเสีย”");
                    mContext.startActivity(intent);
                }//9.
                if (modellist.get(postition).getTitle().equals("เรือเอกไชยเหินหาว")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือเอกไชยเหินหาว");
                    intent.putExtra("contentTv", "เรือเอกไชยเหินหาว");
                    intent.putExtra("detailBoat", "\t\tเรือเอกไชยเหินหาวสร้างขึ้นในสมัยรัชกาลที่ 1 เรือลำนี้ได้ถูกระเบิดได้รับความเสียหายใน สงครามโลกครั้งที่ 2 พ.ศ. 2487 ต่อมากรมศิลปากร\n" +
                            "ได้ตัดหัวเรือและท้ายเรือเก็บรักษาไว้ในพิพิธภัณฑ์ เมื่อปี 2491 ลำปัจจุบัน สร้างขึ้นเมื่อปี พ.ศ. 2508 จากหัวและท้ายเรือเดิม\n" +
                            "โดยกรมอู่ทหารเรือ วางกระดูกงูเรือเมื่อวันที่ 2 เมษายน พ.ศ. 2508 เริ่มสร้างเมื่อ 4 มิถุนายน พ.ศ. 2508 ลงน้ำเมื่อ\n" +
                            "18 กันยายน พ.ศ. 2510 จากนั้นจึงทำการตกแต่งตัวเรือโดยช่างแกะสลักทำงานประมาณ 14 เดือนช่างรักปิดทองทำงาน 6 เดือน\n" +
                            "ช่างเขียนลายรดน้ำทำงานประมาณ 6 เดือน ช่างปิดทองและประดับกระจกทำงานประมาณ 4 เดือน ในปี พ.ศ. 2524\n" +
                            "ได้ทำการซ่อมใหญ่ เปลี่ยนไม้ตัวเรือที่ผุซึ่งชำรุดบางส่วน ลงรักปิดทอง ทาสีตัวเรือใหม่และอื่นๆ เพื่อให้ทันใช้ในงานสมโภชน์กรุงรัตนโกสินทร์\n" +
                            "200 ปี ในวันที่ 5 เมษายน พ.ศ. 2525 เริ่มซ่อมทำตั้งแต่ 4 กันยายน พ.ศ. 2524 จนถึงวันที่ 2 มีนาคม\n" +
                            "พ.ศ. 2525 โดยมี บริษัท สหายสันต์ จำกัด เป็นผู้รับเหมาซ่อมทำ\n"+
                            "\n"+ "ลักษณะ\n"+"\t\tโขนเรือ เป็นไม้รูปดั้งเชิดสูง เขียนลายรดน้ำรูปเหราหรือ จระเข้ ปิดทอง ขนาด : ความยาว 29.76 เมตร กว้าง 2.06 เมตร กินน้ำลึก 0.60 เมตร กำลัง : 3.00 เมตร\n" +
                            "เจ้าพนักงานประจำเรือ : ฝีพาย 38 นาย นายท้าย 2 นาย\n ");
                    mContext.startActivity(intent);
                }//10.
                if (modellist.get(postition).getTitle().equals("เรือครุฑเหินเห็จ")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือครุฑเหินเห็จ");
                    intent.putExtra("contentTv", "เรือครุฑเหินเห็จ");
                    intent.putExtra("detailBoat", "\t\tเรือครุฑเหินเห็จ ลำเดิมนั้นสร้างขึ้นในรัชสมัยของพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช รัชกาลที่ 1 เป็นเรือรูปสัตว์เทพนิยาย เป็นเรือพื้นดำ\n" +
                            "ยาวประมาณ 27 เมตร กว้าง 1.90 เมตร แต่ได้ถูกระเบิดในช่วงสงครามโลกครั้งที่ 2 ได้รับความเสียหาย\n" +
                            "ทางกรมศิลปากรจึงได้ตัดส่วนหัวเรือและท้ายเรือเก็บไว้ในพิพิธภัณฑ์ต่อมาในปีพ.ศ.2505 เมื่อวันที่ 21 เมษายน ได้รับการบูรณะสร้าง\n" +
                            "ตัวเรือขึ้นมาใหม่โดยใช้ส่วนหัวและท้ายเรือเดิมนำมาประกอบเข้าด้วยกัน ตัวเรือลำใหม่นี้มีความยาว 27.50 เมตร กว้าง 1.59 เมตร\n" +
                            "และลึก 0.59 เมตร ส่วนที่กินน้ำลึก 32 เซนติเมตร ใช้ฝีพาย 38 นาย และนายท้าย 2 นายในปีพ.ศ.2511 ได้ดำเนินการบูรณะ\n" +
                            "ซ่อมแซมลำเรือใหม่ โดยใช้ช่างแกะสลักลวดลายใช้เวลาในการทำงานประมาณ 18 เดือน ช่างรักทำงาน 6 เดือน ช่างเขียนลายรดน้ำทำงานประมาณ\n" +
                            "6 เดือน ช่างปิดทองและประดับกระจกทำงานประมาณ 4 เดือนระหว่างวันที่ 15 มีนาคม - 10 กันยายน พ.ศ.2514\n" +
                            "สำนักงานเกษรดอกประดู่ ได้รับเหมาดำเนินการทำเครื่องตกแต่งเรือใหม่ และเมื่อปีพ.ศ.2524 ได้ดำเนินการซ่อมครั้งใหญ่\n" +
                            "เพื่อใช้ในงานสมโภชกรุงรัตนโกสินทร์ 200 ปี ที่จะจัดขึ้นในวันที่ 5 เมษายน พ.ศ.2525 โดยเริ่มดำเนินการตั้งแต่วันที่\n" +
                            "4 กันยายน พ.ศ.2524 ถึงวันที่ 2 มีนาคม พ.ศ.2525 โดยเปลี่ยนไม้ตัวเรือที่ผุพัง ลงรักปิดทองแล้วทาสีใหม่\n" +
                            "และส่วนอื่น ๆ ตามความเหมาะสม ดำเนินการโดยบริษัทสหายสันต์ จำกัด\n"+
                            "\n"+
                            "ลักษณะ\n"+"\t\tการบูรณะสร้างตัวเรือขึ้นมาใหม่โดยใช้ส่วนหัวและท้ายเรือเดิมนำมาประกอบเข้าด้วยกันขนาด : ความยาว 27.50 เมตร กว้าง 1.59 เมตร และลึก 0.59 เมตร ส่วนที่กินน้ำลึก 32 เซนติเมตร\n" +
                            "เจ้าพนักงานประจำเรือ : ใช้ฝีพาย 38 นาย และนายท้าย 2 นาย\n");
                    mContext.startActivity(intent);
                }//11.
                if (modellist.get(postition).getTitle().equals("เรือสิงห์")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือสิงห์");
                    intent.putExtra("contentTv", "เรือสิงห์");
                    intent.putExtra("detailBoat", "\t\tเป็นเรือพระที่นั่ง มีโขนเป็นรูปหงส์ทอง เรียกสั้นๆว่า เรือหงส์ คำว่าสุวรรณ เป็นคำนาม หมายถึง ทอง ส่วน หงส์ นั้นหมายถึงนกในนิยายที่ ถือว่าเป็นนกในตระกูลสูง\n" +
                            "มีเสียงไพเราะ และเป็น พาหนะของพระราม เราจะเห็นว่าในวรรณคดีส่วนใหญ่ จะอ้างการเดินที่งดงามอ่อนช้อยว่า เดินเหมือนหงส์");
                    mContext.startActivity(intent);
                }//12.
                if (modellist.get(postition).getTitle().equals("เรือม้า")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือม้า");
                    intent.putExtra("contentTv", "เรือม้า");
                    intent.putExtra("detailBoat", "\t\tเป็นเรือที่มีโขนเป็นรูปม้า เพราะโดยทั่วไปของม้าจะเป็นสัตว์กีบเดียว รูปร่างสูงใหญ่ ขายาว หางเป็นพู่ มีแผงคอยาว จึงนิยมนำมาทำเป็นพาหนะ");
                    mContext.startActivity(intent);
                }//13.
                if (modellist.get(postition).getTitle().equals("เรือพระที่นั่งอนันตนาคราช(เรือวาสุกรี)")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือพระที่นั่งอนันตนาคราช(เรือวาสุกรี)");
                    intent.putExtra("contentTv", "เรือพระที่นั่งอนันตนาคราช(เรือวาสุกรี)");
                    intent.putExtra("detailBoat", "หัวเรือจำหลักรูปพญานาคเจ็ดเศียร ลงรักปิดทองประดับกระจก ท้องเรือภายในทาสีแดง ภายนอกทาสีเขียว\n" +
                            "กลางลำเรือเป็นบุษบกประดิษฐานพระพุทธรูปหรือผ้าพระกฐิน เรือมีความยาว 44.85 เมตร กว้าง 2.58\n" +
                            "เมตร ลึกถึงท้องเรือ 87 เซนติเมตร กินน้ำลึก 31 เซนติเมตร ใช้กำลังพลประกอบด้วย ฝีพาย 54 คน\n" +
                            "นายเรือ 2 คน นายท้าย 2 คน คนถือธงท้าย 1 คน พลสัญญาณ 1 คน คนถือฉัตร 7 คน\n" +
                            "คนถือบังสูรย์-พัดโบก-พระกลด 3 คน และคนเห่เรือ 1 คน\n"+
                            "\n"+"ลักษณะ\n"+"\t\tหัวเรือจำหลักรูปพญานาคเจ็ดเศียร ลงรักปิดทองประดับกระจก ท้องเรือภายในทาสีแดง ภายนอกทาสีเขียว\n" +
                            "กลางลำเรือเป็นบุษบกประดิษฐานพระพุทธรูปหรือผ้าพระกฐิน เรือมีความยาว 44.85 เมตร กว้าง 2.58เมตร\n" +
                            "ลึกถึงท้องเรือ 87 เซนติเมตร กินน้ำลึก 31 เซนติเมตร ใช้กำลังพลประกอบด้วย ฝีพาย 54 คน\n" +
                            "นายเรือ 2 คน นายท้าย 2 คน คนถือธงท้าย 1 คน พลสัญญาณ 1 คน คนถือฉัตร 7 คน คนถือบังสูรย์-พัดโบก-พระกลด 3 คน และคนเห่เรือ 1 คน");
                    mContext.startActivity(intent);
                }//14.
                if (modellist.get(postition).getTitle().equals("เรือคชสีห์")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือคชสีห์");
                    intent.putExtra("contentTv", "เรือคชสีห์");
                    intent.putExtra("detailBoat", "\t\tเรือคชสีห์ เป็นเรือที่มีหัวเรือเป็นรูปสัตว์ คชสีห์ เป็นสิงห์ผสมที่มีกายเป็นสิงห์ และมีช่วงหัวเป็นช้าง\n" +
                            "ตามตำรากล่าวว่าคชสีห์มีพลังเทียบเท่าช้างและสิงห์รวมกัน ซึ่งนับได้ว่าเป็นสัตว์ที่น่าเกรงขาม คชสีห์มีลักษณะคล้ายสัตว์หิมพานต์อีกชนิดหนึ่งชื่อทักทอ");
                    mContext.startActivity(intent);
                }//15.
                if (modellist.get(postition).getTitle().equals("เรือราชสีห์")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือราชสีห์");
                    intent.putExtra("contentTv", "เรือราชสีห์");
                    intent.putExtra("detailBoat", "\t\tเป็นเรือที่มีหัวโขนเรือเป็นรูปสิงโต  เป็นสัตว์ที่มีกำลังมาก  เมื่อโตเต็มวัยจะมีขนสร้อยคอยาว(ตัวผู้) ราชสีห์หรือสิงโต  มีปรากฎในนิยายจีน\n" +
                            "และในป่าหิมพานต์ไกรสรราชสีห์เป็น ๑ ใน ๔ ราชสีห์แห่งป่าหิมพานต์ ในตำนานกล่าวว่าไกรสรราชสีห์เป็นสัตว์ที่มีพละกำลังแรงกล้า ทรงพลัง\n" +
                            "กายเป็นสิงห์ มีขนแผงคอ ริมฝีปากขนหาง และเล็บเป็นสีแดงดั่งผ้ารัตนกัมพล เป็นนักล่าชั้นเยี่ยมและกินสัตว์ใหญ่น้่อยเป็นอาหาร สร้างขึ้นตั้งแต่รัชกาล\n" +
                            "สมเด็จพระมหาจักรพรรดิ ในสมัยกรุงศรีอยุธยา  เป็นเรือที่แกะสลักหัวเรือ เป็นรูปสัตว์ต่าง ๆ ทั้งสัตว์จริง และสัตว์ในเทพนิยายเพื่อจะให้\n" +
                            "ตั้งปืนใหญ่ที่หัวเรือได้ เรือรูปสัตว์ มาจากตราประจำตำแหน่ง ของเสนาบดีแต่เดิมเรือเหล่านี้เคยเป็นเรือรบมาก่อน ต่อมาการบจบศึกลง\n" +
                            "เหล่านี้จึงกลายมาเป็น เรือที่ใช้ในพระราชพิธีต่าง ๆที่พระมหากษัตริย์ไทยเสด็จพระราชดำเนินโดย กระบวนพยุหยาตราชลมารคมาจนเท่าทุกวันนี้");
                    mContext.startActivity(intent);
                }//16.
                if (modellist.get(postition).getTitle().equals("เรือมังกร")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือมังกร");
                    intent.putExtra("contentTv", "เรือมังกร");
                    intent.putExtra("detailBoat", "\t\tเป็นสัตว์วิเศษที่รู้จักกันในวรรณคดี มีรูปร่างลักษณะจัดอยู่ไนประเภทสัตว์เลื้อยคลานหรืองู ตามีเท้ามีเขา คาดว่าน่าจะมาจากสัตว์ในนิยายของจีน");
                    mContext.startActivity(intent);
                }//17.
                if (modellist.get(postition).getTitle().equals("เรือเลียงผา")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือเลียงผา");
                    intent.putExtra("contentTv", "เรือเลียงผา");
                    intent.putExtra("detailBoat", "\t\tเรือเลียงผาถ้าหากเอ่ยชื่อเรือชนิดนี้ขึ้นมา หลายๆคนคงอาจจะรู้จัก เพราะเรือเลียงผา คือ 1 ใน 15 ลำ ของเรือพระที่นั่งเป็นการนำ\n" +
                            "เอาลักษณะของหัวเลียงผามาทำเป็นหัวเรือ และ หลายๆคนคงรู้ว่าเลียงผาเป็นสัตว์ป่าสงวน และ เป็นสัตว์ในวรรณคดีด้วย\n" +
                            "และนี่คือที่มาของลักษณะและชื่อของเรือเลียงผา");
                    mContext.startActivity(intent);
                }//18.
                if (modellist.get(postition).getTitle().equals("เรือนกอินทรี")){
                    //start NewActivity with title for actionbar and text for textview
                    Intent intent = new Intent(mContext, NewActivity.class);
                    intent.putExtra("actionBarTitle", "เรือนกอินทรี");
                    intent.putExtra("contentTv", "เรือนกอินทรี");
                    intent.putExtra("detailBoat", "\t\tเป็นเรือที่มีหัวเรือเป็นนกอินทรี เพราะอินทรีได้ชื่อว่าเป็นสัตว์ที่มีพละกำลังมากกรงเล็บแข็งแรง จึงเหมาะกับการนำเอามาเป็นหัวโขนเรือรูปสัตว์\n" +
                            "เรือรูปสัตว์นี้แต่ละลำมีปืนจ่ารงประจำที่โขนเรือลำละ ๑ กระบอก  อาวุธอื่นมี  เขน  ดาบ ทวน  หอก  ง้าว และมีหางนกยูงประดับ\n" +
                            "มีนายเรือนายท้าย  และฝีพาย ลำละ ๓๗ นาย  มีนายเส้า ๒ นาย  ผู้เชิญธงสามชายทางท้ายเรือหรือที่เรียกว่า นักสราช\n" +
                            "ลำละ ๑ นาย ผู้เชิญธงสามชายนี้ในสมัยก่อนเป็นหน้าที่ของตำรวจหลวง");
                    mContext.startActivity(intent);
                }
            }
        });


        return view;
    }

    //filter
    public void filter(String charText){
        charText = charText.toLowerCase(Locale.getDefault());
        modellist.clear();
        if (charText.length()==0){
            modellist.addAll(arrayList);
        }
        else {
            for (Model model : arrayList){
                if (model.getTitle().toLowerCase(Locale.getDefault())
                        .contains(charText)){
                    modellist.add(model);
                }
            }
        }
        notifyDataSetChanged();
    }

}
